"""всі стовпці мають ширину 10 символів
у заголовків таблиці вирівнювання по центру
перший стовпець десяткових чисел — вирівнювання по лівому краю
другий стовпець шістнадцяткових чисел — вирівнювання по центру
третій стовпець двійкових чисел — вирівнювання з правого краю
вертикальний символ | не входить у ширину стовпця
Як ви вже зрозуміли, функція formatted_numbers виводить таблицю чисел від 0 до 15 у десятковому, шістнадцятковому та бінарному форматі."""


def formatted_numbers():
    form = "|{:^10}|{:^10}|{:^10}|".format("decimal", "hex", "binary")
    s = [form]
    for i in range(16):
        line = "|{:<10}|{:^10}|{:>10}|".format(i, hex(i)[2:], bin(i)[2:])
        s.append(line)
    return s


for el in formatted_numbers():
    print(el)
